{
	"welcome-title": "Welcome to Casanode!",
	"welcome-text": "This wizard will guide you through the setup process step by step,  ensuring a smooth and easy configuration.",
	"welcome-next": "Click \"Next\" to begin your  journey to decentralized internet access!",
	
	"moniker-title": "Set Your Node's Moniker",
	"moniker-text": "Give your node a unique name to identify it within the decentralized VPN  network.",
	"moniker-explain": "This name will represent your node to others, so choose a  moniker that is memorable and distinctive.",
	"moniker-placeholder": "Enter your moniker",
	
	"location-title": "Select Node Location",
	"location-text": "Choose the type of environment where your node is hosted. This helps configure network settings for optimal performance.",
	"location-residential": "Residential",
	"location-datacenter": "Datacenter",
	"location-residential-desc": "Residential: If your node is hosted in a home or personal space.",
	"location-datacenter-desc": "Datacenter: If your node is hosted in a datacenter or server facility.",
	"location-placeholder": "Choose location",
	
	"protocol-title": "Select Your VPN Protocol",
	"protocol-text": "Choose the protocol that best suits your needs:",
	"protocol-wireguard": "WireGuard",
	"protocol-wireguard-desc": "A fast and modern VPN protocol known for its simplicity and strong encryption.",
	"protocol-v2ray": "V2Ray",
	"protocol-v2ray-desc": "A versatile protocol supporting multiple features, ideal for bypassing internet censorship.",
	"protocol-placeholder": "Choose protocol",
	
	"network-title": "Configure Network Settings",
	"network-text": "Provide the following information to set up your node's network:",
	"network-public-ip": "Public IP",
	"network-api-port": "API Port",
	"network-wireguard-port": "WireGuard Port",
	"network-v2ray-port": "V2Ray Port",
	
	"protection-title": "Wallet Protection",
	"protection-text": "Do you wish to protect your wallet with a passphrase? This will enhance security, but the passphrase will be required every time the node restarts.",
	
	"passphrase-title": "Enter Wallet Password",
	"passphrase-text": "Create a strong password to secure your wallet. It must contain at least 8 characters.",
	"passphrase-placeholder": "Enter your password",
	
	"wallet-title": "Wallet Configuration",
	"wallet-text": "Would you like to restore an existing crypto wallet or create a new one?  Select \"Restore\" to recover a wallet using your seed phrase or backup,  or choose \"Create\" to generate a new wallet with a secure seed phrase.",
	
	"wallet-restore-title": "Restore Existing Wallet",
	"wallet-restore-text": "Please enter your recovery mnemonic phrase below to restore your wallet  address. Ensure that the words are entered in the correct order, and  each word is separated by a space.",
	"wallet-restore-placeholder": "Enter or Paste your recovery phrase",
	"wallet-restore-warning": "Your mnemonic phrase is sensitive  information, so handle it securely and never share it with anyone.",
	
	"wallet-create-title": "Create New Wallet",
	"wallet-create-text": "Your recovery mnemonic for the node wallet is as follows:",
	"wallet-create-backup-title": "Backup your mnemonic securely",
	"wallet-create-backup-text": "It's essential for recovering your wallet if you lose access or forget your passphrase. Loss of this phrase means permanent loss of access to your funds and dVPN node. Store it privately and in multiple safe places.",
	
	"wallet-fund-title": "Fund Your Node Wallet",
	"wallet-fund-text": "Please deposit at least 10 $DVPN to your wallet at the address below to proceed with starting the node:",
	"wallet-fund-next": "Once you have transferred the funds, select “Next” to continue.",
	"wallet-fund-copied": "Copied to clipboard",
	
	"button-next": "Next",
	"button-yes": "Yes",
	"button-no": "No",
	"button-create": "Create",
	"button-restore": "Restore",
	"button-test-ports": "Test Ports",
	"button-finish": "Finish"
}